a = {
    'Корова в банке':           ['Подари другу банку тушенки',                                              '(7*ур)хр. 3ж'],
    'Настоящее чудо':           ['Подари другу банку тушенки',                                              '(7*ур)хр. VIP'],
    'На черный день':           ['Подари другу сухари',                                                     '(5*ур)хр. (20*ур)пуль'],

    'Человек с большой душой':  ['Подари друзьям 10 подарков',                                              '(15*ур)хр, (20*ур)пуль'],
    'Странная коробка':         ['Подари друзьям 10 подарков',                                              '(5*ур)хр, 1ж'],
    'Напоминание':              ['Подари друзьям 15 подарков',                                              '(30*ур)хр, 1аптечка'],

    'Упаковка':                 ['Открой 8 подарков от друзей',                                             '(7*ур)хр, (7*ур)пуль'],
    'Подарки судьбы':           ['Открой 12 подарков от друзей',                                            '(7*ур)хр, VIP'],

    'беспорядок':               ['Победи на арене 15 случайных соперников',                                 '(7*ур)хр. 1ж'],
    'Настоящий подвиг':         ['Победи на арене 25 противников, не проиграв ни разу',                     '(20*ур)хр, (15*ур)пуль'],

    'Ни труса, ни лжеца':       ['Победи в бою 15 друзей',                                                  '(7*ур)хр, VIP'],
    'Настоящий джигит':         ['Победи в бою 15 друзей',                                                  '(15*ур)хр, 1ж'],

    'Сделка':                   ['Выполня поручения любого начальника станции, победи 7 арахн',             '(20*ур)хр, (20*ур)пуль'],
    'Смертельный узор':         ['Выполня поручения любого начальника станции, победи 10 арахн',            '(20*ур)хр, 3ж'],

    'Украденная карта':         ['Выполня поручения любого начальника станции, победи 10 шпионов',          '(7*ур)хр, (1ж)'],
    'Секрет Харона':            ['Выполня поручения любого начальника станции, победи 20 шпионов',          '(5*ур)хр, (30*ур)пуль'],

    'Счетчик Гейгера':          ['Выполня поручения любого начальника станции, победи 7 контрабандистов',   '(5*ур)хр, 3корма'],
    'В контрах':                ['Выполня поручения любого начальника станции, победи 15 контрабандистов',  '(10*ур)хр, (10*ур)пуль'],
    'Подозрительный мешочек':   ['Выполня поручения любого начальника станции, победи 15 контрабандистов',  '(30*ур)хр, 2жетона'],

    'Добрый человек':           ['Выполни  5 поручений любого начальника станции',                          '(5*ур)хр, (5*ур)пуль'],
    'Срочные дела':             ['Выполни 10 поручений любого начальника станции',                          '(5*ур)хр, (5*ур)пуль'],
    'Обещанная помощь':         ['Выполни 12 поручений любого начальника станции',                          '(7*ур)хр, 1ж'],
    'Хороший парень':           ['Выполни 15 поручений любого начальника станции',                          '(5*ур)хр, (5*ур)пуль'],

    'Горный зверь':             ['Вызови питомца в бой 5 раз',                                              '(20*ур)хр, (15*ур)пуль'],

    'Спрятанные предметы':      ['Обыщи 5 палаток друзей',                                                  '(5*ур)хр, 1ж'],
    'Под покровом тьмы':        ['Обыщи 10 палаток друзей',                                                 '(10*ур)хр, 3корма'],

    'Радость жизни':            ['Отработай 4 смены на упаковке чая',                                       '(5*ур)хр, 1ж'],

    'Управление гневом':        ['Увеличь ярость на 5 единиц',                                              '(5*ур)хр, 1ж'],
    'Долгий путь':              ['Увеличь выносливость на 5 единиц',                                        '(5*ур)хр, 1ж'],

    'Проверка гранат':          ['Используй гранату РКГ-3 в бою 3 раза ',                                   '(15*ур)хр, 1ж'],
    '': ['', ''],
}