a = {
    'Корова в банке':           ['Подари другу банку тушенки',                                              '(7*ур)хр. 3ж'],
    'Настоящее чудо':           ['Подари другу банку тушенки',                                              '(7*ур)хр. VIP'],
    'Греча - не рис':           ['Подари другу гречневой каши',                                             '(7*ур)хр. 2ж'],
    'На черный день':           ['Подари другу сухари',                                                     '(5*ур)хр. (20*ур)пуль'],
    'Сухари':                   ['Подари другу сухари',                                                     '(10*ур)хр. 1ж'],
    'Килька другу':             ['Подари другу банку кильки в томате',                                      '(7*ур)хр. 2ж'],

    'Человек с большой душой':  ['Подари друзьям 10 подарков',                                              '(15*ур)хр, (20*ур)пуль'],
    'Странная коробка':         ['Подари друзьям 10 подарков',                                              '(5*ур)хр, 1ж'],
    'Ассистент продавца':       ['Подари друзьям 12 подарков',                                              '(10*ур)хр, 3ж'],
    'Напоминание':              ['Подари друзьям 15 подарков',                                              '(30*ур)хр, 1аптечка'],

    'Упаковка':                 ['Открой 8 подарков от друзей',                                             '(7*ур)хр, (7*ур)пуль'],
    'Если друг окзался вдруг..':['Открой 10 подарков от друзей',                                            '(5*ур)хр, 1ж'],
    'Подарки судьбы':           ['Открой 12 подарков от друзей',                                            '(7*ур)хр, VIP'],

    'Внешняя борьба':           ['Победи на арене 7 случайных соперников',                                  '(5*ур)хр. (5*ур)пуль'],
    'Наказание обидчиков':      ['Победи на арене 10 случайных соперников',                                 '(5*ур)хр. (7*ур)пуль'],
    'Беспорядок':               ['Победи на арене 15 случайных соперников',                                 '(7*ур)хр. 1ж'],
    'Глаза в глаза':            ['Победи на арене 15 случайных соперников',                                 '(7*ур)хр. VIP'],
    'Настоящий подвиг':         ['Победи на арене 25 противников, не проиграв ни разу',                     '(20*ур)хр, (15*ур)пуль'],

    'Сражение с собой':         ['Победи в бою 5 друзей',                                                   '(5*ур)хр, (5*ур)пуль'],
    'Заступник':                ['Победи в бою 7 друзей',                                                   '(7*ур)хр, 1ж'],

    'Ни труса, ни лжеца':       ['Победи в бою 15 друзей',                                                  '(7*ур)хр, VIP'],
    'Настоящий джигит':         ['Победи в бою 15 друзей',                                                  '(15*ур)хр, 1ж'],
    'Сила и честь!':            ['Победи в бою 15 друзей',                                                  '(10*ур)хр, (35*ур)пуль'],

    'Настоящий!':               ['Выпей у начальника станции 3 кружки чая',                                 '(20*ур)хр, 2ж'],

    'Добрый человек':           ['Выполни  5 поручений любого начальника станции',                          '(5*ур)хр, (5*ур)пуль'],
    'Срочные дела':             ['Выполни 10 поручений любого начальника станции',                          '(5*ур)хр, (5*ур)пуль'],
    'Обещанная помощь':         ['Выполни 12 поручений любого начальника станции',                          '(7*ур)хр, 1ж'],
    'Хороший парень':           ['Выполни 15 поручений любого начальника станции',                          '(5*ур)хр, (5*ур)пуль'],
    'Простой труд':             ['Выполни 40 поручений любого начальника станции',                          '(10*ур)хр, 1ж'],

    'Кабель':                   ['Выполня поручения любого начальника станции, победи 40 серых крыс',       '(20*ур)хр, (30*ур)пуль'],

    'Украденная карта':         ['Выполня поручения любого начальника станции, победи 10 шпионов',          '(7*ур)хр, 1ж'],
    'Секрет Харона':            ['Выполня поручения любого начальника станции, победи 20 шпионов',          '(5*ур)хр, (30*ур)пуль'],
    'Расправа':                 ['Выполня поручения любого начальника станции, победи 27 шпионов',          '(20*ур)хр, 1ж'],

    'Счетчик Гейгера':          ['Выполня поручения любого начальника станции, победи 7 контрабандистов',   '(5*ур)хр, 3корма'],
    'Опасный товар':            ['Выполня поручения любого начальника станции, победи 10 контрабандистов',  '(5*ур)хр, (7*ур)пуль'],
    'Лохи':                     ['Выполня поручения любого начальника станции, победи 15 контрабандистов',  '(10*ур)хр, (30*ур)пуль'],
    'В контрах':                ['Выполня поручения любого начальника станции, победи 15 контрабандистов',  '(10*ур)хр, (10*ур)пуль'],
    'Подозрительный мешочек':   ['Выполня поручения любого начальника станции, победи 15 контрабандистов',  '(30*ур)хр, 2жетона'],

    'Сделка':                   ['Выполня поручения любого начальника станции, победи 7 арахн',             '(20*ур)хр, (20*ур)пуль'],
    'Смертельный узор':         ['Выполня поручения любого начальника станции, победи 10 арахн',            '(20*ур)хр, 3ж'],

    'Горный зверь':             ['Вызови питомца в бой 5 раз',                                              '(20*ур)хр, (15*ур)пуль'],
    'Чей питомец?':             ['Вызови питомца в бой 7 раз',                                              '(7*ур)хр, (10*ур)пуль'],

    'Грустные глаза':           ['Покорми питомца 5 раз',                                                   '(5*ур)хр, 1ж'],

    'Спрятанные предметы':      ['Обыщи 5 палаток друзей',                                                  '(5*ур)хр, 1ж'],
    'Чужие палатки':            ['Обыщи 8 палаток друзей',                                                  '(5*ур)хр, (5*ур)пуль'],
    'Потерянный кулон':         ['Обыщи 10 палаток друзей',                                                 '(7*ур)хр, (7*ур)пуль'],
    'Под покровом тьмы':        ['Обыщи 10 палаток друзей',                                                 '(10*ур)хр, 3корма'],

    'Радость жизни':            ['Отработай 4 смены на упаковке чая',                                       '(5*ур)хр, 1ж'],
    'Чайный паек':              ['Отработай 3 смены на упаковке чая',                                       '(7*ур)хр, (10*ур)пуль'],
    'Отходняки':                ['Отработай 3 смены сборщиком грибов',                                      '(15*ур)хр, 3корма'],
    'Особенные грибы':          ['Отработай 3 смены сборщиком грибов',                                      '(7*ур)хр, (10*ур)пуль'],

    'Зоркий глаз':              ['Увеличь меткость на 3 единицы',                                           '(20*ур)хр, (20*ур)пуль'],
    'Мазила':                   ['Увеличь меткость на 5 единицы',                                           '(5*ур)хр, (14*ур)пуль'],

    'Управление гневом':        ['Увеличь ярость на 5 единиц',                                              '(5*ур)хр, 1ж'],

    'Правда жизни':             ['Увеличь выносливость на 5 единиц',                                        '(30*ур)хр, (25*ур)пуль'],
    'Срочная доставка':         ['Увеличь выносливость на 5 единиц',                                        '(5*ур)хр, (12*ур)пуль'],
    'Долгий путь':              ['Увеличь выносливость на 5 единиц',                                        '(5*ур)хр, 1ж'],
    'Слишком здоровый':         ['Увеличь выносливость на 6 единиц',                                        '(15*ур)хр, 1ж'],

    'Проверка гранат':          ['Используй гранату РКГ-3 в бою 3 раза ',                                   '(15*ур)хр, 1ж'],


    'Стероиды':                 ['Отправляйся на <Третьяковскую>, открой окно букмекера и сделай ставку на любую крысу', '(20*ур)хр, 1фишка'],
    '': ['', ''],
}