a = {
    'Корова в банке': ['Подари другу банку тушенки','(7*ур)хр. 3ж'],
    'Настоящее чудо': ['Подари другу банку тушенки','(7*ур)хр. VIP'],

    'беспорядок': ['Победи на арене 15 случайных соперников','(7*ур)хр. 1ж'],

    'Сделка':           ['Выполня поручения любого начальника станции, победи 7 арахн',    '(20*ур)хр, (20*ур)пуль'],
    'Смертельный узор': ['Выполня поручения любого начальника станции, победи 10 арахн',   '(20*ур)хр, 3ж'],
    'Секрет Харона':    ['Выполня поручения любого начальника станции, победи 20 шпионов', '(5*ур)хр, (30*ур)пуль'],


    'Срочные дела':     ['Выполни 10 поручений любого начальника станции',                  '(5*ур)хр, (5*ур)пуль'],
    'Обещанная помощь': ['Выполни 12 поручений любого начальника станции',                  '(7*ур)хр, 1ж'],
    '*': ['',''],
    '': ['',''],
}