a = {
    'Корова в банке':           ['Подари другу банку тушенки',                                              '(7*ур)хр. 3ж'],
    'Настоящее чудо':           ['Подари другу банку тушенки',                                              '(7*ур)хр. VIP'],

    'Человек с большой душой':  ['Подари друзьям 10 подарков',                                              '(15*ур)хр, (20*ур)пуль'],

    'беспорядок':               ['Победи на арене 15 случайных соперников',                                 '(7*ур)хр. 1ж'],

    'Сделка':                   ['Выполня поручения любого начальника станции, победи 7 арахн',             '(20*ур)хр, (20*ур)пуль'],
    'Смертельный узор':         ['Выполня поручения любого начальника станции, победи 10 арахн',            '(20*ур)хр, 3ж'],

    'Украденная карта':         ['Выполня поручения любого начальника станции, победи 10 шпионов',          '(7*ур)хр, (1ж)'],
    'Секрет Харона':            ['Выполня поручения любого начальника станции, победи 20 шпионов',          '(5*ур)хр, (30*ур)пуль'],

    'Счетчик Гейгера':          ['Выполня поручения любого начальника станции, победи 7 контрабандистов',   '(5*ур)хр, 3корма'],

    'Срочные дела':             ['Выполни 10 поручений любого начальника станции',                          '(5*ур)хр, (5*ур)пуль'],
    'Обещанная помощь':         ['Выполни 12 поручений любого начальника станции',                          '(7*ур)хр, 1ж'],
    'Хороший парень':           ['Выполни 15 поручений любого начальника станции',                          '(5*ур)хр, (5*ур)пуль'],

    'Горный зверь':             ['Вызови питомца в бой 5 раз',                                              '(20*ур)хр, (15*ур)пуль'],

    'Спрятанные предметы':      ['Обыщи 5 палаток друзей',                                                  '(5*ур)хр, 1ж'],
    'Под покровом тьмы':        ['Обыщи 10 палаток друзей',                                                 '(10*ур)хр, 3корма'],

    'Радость жизни':            ['Отработай 4 смены на упаковке чая',                                       '(5*ур)хр, 1ж'],

    'Настоящий подвиг':         ['Победи на арене 25 противников, не проиграв ни разу',                     '(20*ур)хр, (15*ур)пуль'],

    'Управление гневом':        ['Увеличь ярость на 5 единиц',                                              '(5*ур)хр, 1ж'],
    'Напоминание':              ['Подари друзьям 15 подарков',                                              '(30*ур) 1аптечка'],
    '': ['', ''],
}