a = {
    'Корова в банке':               ['Подари другу банку тушенки',                                              '(7*ур)хр. 3ж'],
    'Настоящее чудо':               ['Подари другу банку тушенки',                                              '(7*ур)хр. VIP'],
    'Греча - не рис':               ['Подари другу гречневой каши',                                             '(7*ур)хр. 2ж'],
    'Лучший подарок':               ['Подари другу гречневой каши',                                             '(20*ур)хр. 1ж'],
    'На черный день':               ['Подари другу сухари',                                                     '(5*ур)хр. (20*ур)пуль'],
    'Сухари':                       ['Подари другу сухари',                                                     '(10*ур)хр. 1ж'],
    'Килька другу':                 ['Подари другу банку кильки в томате',                                      '(7*ур)хр. 2ж'],

    'Редкий товар':                 ['Подари друзьям 8 подарков',                                               '(5*ур)хр, 3корма'],
    'Человек с большой душой':      ['Подари друзьям 10 подарков',                                              '(15*ур)хр, (20*ур)пуль'],
    'Странная коробка':             ['Подари друзьям 10 подарков',                                              '(5*ур)хр, 1ж'],
    'Ассистент продавца':           ['Подари друзьям 12 подарков',                                              '(10*ур)хр, 3ж'],
    'Напоминание':                  ['Подари друзьям 15 подарков',                                              '(30*ур)хр, 1аптечка'],
    'Круговорот доброты':           ['Подари друзьям 15 подарков',                                              '(15*ур)хр, 3корма'],

    'Упаковка':                     ['Открой 8 подарков от друзей',                                             '(7*ур)хр, (7*ур)пуль'],
    'Если друг оказался вдруг..':   ['Открой 10 подарков от друзей',                                            '(5*ур)хр, 1ж'],
    'Подарки судьбы':               ['Открой 12 подарков от друзей',                                            '(7*ур)хр, VIP'],

    'Внешняя борьба':               ['Победи на арене 7 случайных соперников',                                  '(5*ур)хр. (5*ур)пуль'],
    'Навыки боя':                   ['Победи на арене 7 случайных соперников',                                  '(5*ур)хр. 3корма'],
    'Наказание обидчиков':          ['Победи на арене 10 случайных соперников',                                 '(5*ур)хр. (7*ур)пуль'],
    'Беспорядок':                   ['Победи на арене 15 случайных соперников',                                 '(7*ур)хр. 1ж'],
    'Глаза в глаза':                ['Победи на арене 15 случайных соперников',                                 '(7*ур)хр. VIP'],
    'Настоящий подвиг':             ['Победи на арене 25 противников, не проиграв ни разу',                     '(20*ур)хр, (15*ур)пуль'],
    'Хвост':                        ['Победи на арене 25 противников, не проиграв ни разу',                     '(30*ур)хр, (25*ур)пуль'],

    'Сражение с собой':             ['Победи в бою 5 друзей',                                                   '(5*ур)хр, (5*ур)пуль'],
    'Пять бойцов':                  ['Победи в бою 5 друзей',                                                   '(10*ур)хр, 1ж'],
    'Не спрашивай':                 ['Победи в бою 6 друзей',                                                   '(5*ур)хр, (5*ур)пуль'],
    'Заступник':                    ['Победи в бою 7 друзей',                                                   '(7*ур)хр, 1ж'],
    'Ни труса, ни лжеца':           ['Победи в бою 15 друзей',                                                  '(7*ур)хр, VIP'],
    'Настоящий джигит':             ['Победи в бою 15 друзей',                                                  '(15*ур)хр, 1ж'],
    'Бей своих':                    ['Победи в бою 15 друзей',                                                  '(7*ур)хр, 1ж'],
    'Сила и честь!':                ['Победи в бою 15 друзей',                                                  '(10*ур)хр, (35*ур)пуль'],

    'Освежись':                     ['Выпей у начальника станции 2 кружки чая',                                 '(20*ур)хр, П.аптечка'],
    'Настоящий!':                   ['Выпей у начальника станции 3 кружки чая',                                 '(20*ур)хр, 2ж'],
    'Не обижай хозяина':            ['Выпей у начальника станции 3 кружки чая',                                 '(20*ур)хр, 2ж'],

    'Добрый человек':               ['Выполни  5 поручений любого начальника станции',                          '(5*ур)хр, (5*ур)пуль'],
    'Срочные дела':                 ['Выполни 10 поручений любого начальника станции',                          '(5*ур)хр, (5*ур)пуль'],
    'Ответственное задание':        ['Выполни 10 поручений любого начальника станции',                          '(7*ур)хр, 1ж'],
    'Обещанная помощь':             ['Выполни 12 поручений любого начальника станции',                          '(7*ур)хр, 1ж'],
    'Хороший парень':               ['Выполни 15 поручений любого начальника станции',                          '(5*ур)хр, (5*ур)пуль'],
    'Должок':                       ['Выполни 20 поручений любого начальника станции',                          '(7*ур)хр, 3корма'],
    'Простой труд':                 ['Выполни 40 поручений любого начальника станции',                          '(10*ур)хр, 1ж'],

    'Крысолов':                     ['Выполня поручения любого начальника станции, победи 7 серых крыс',        '(5*ур)хр, (5*ур)пуль'],
    'Кабель':                       ['Выполня поручения любого начальника станции, победи 40 серых крыс',       '(20*ур)хр, (30*ур)пуль'],
    'Серая тьма':                   ['Выполня поручения любого начальника станции, победи 45 серых крыс',       '(5*ур)хр, (30*ур)пуль'],

    'Белый крыс':                   ['Выполня поручения любого начальника станции, победи 12 белых крыс',       '(10*ур)хр, 1ж'],
    'Чистка тоннелей':              ['Выполня поручения любого начальника станции на Новокузнецкой,'
                                    ' победи 5 песчаных крыс',                                                 '(7*ур)хр, 2ж'],

    'Покушение':                    ['Выполня поручения любого начальника станции, победи 5 шпионов',           '(5*ур)хр, (5*ур)пуль'],
    'Украденная карта':             ['Выполня поручения любого начальника станции, победи 10 шпионов',          '(7*ур)хр, 1ж'],
    'Секрет Харона':                ['Выполня поручения любого начальника станции, победи 20 шпионов',          '(5*ур)хр, (30*ур)пуль'],
    'Расправа':                     ['Выполня поручения любого начальника станции, победи 27 шпионов',          '(20*ур)хр, 1ж'],

    'Счетчик Гейгера':              ['Выполня поручения любого начальника станции, победи 7 контрабандистов',   '(5*ур)хр, 3корма'],
    'Спецоперация':                 ['Выполня поручения любого начальника станции, победи 7 контрабандистов',   '(5*ур)хр, (5*ур)пуль'],
    'Опасный товар':                ['Выполня поручения любого начальника станции, победи 10 контрабандистов',  '(5*ур)хр, (7*ур)пуль'],
    'Лохи':                         ['Выполня поручения любого начальника станции, победи 15 контрабандистов',  '(10*ур)хр, (30*ур)пуль'],
    'В контрах':                    ['Выполня поручения любого начальника станции, победи 15 контрабандистов',  '(10*ур)хр, (10*ур)пуль'],
    'Подозрительный мешочек':       ['Выполня поручения любого начальника станции, победи 17 контрабандистов',  '(30*ур)хр, 2жетона'],

    'Сделка':                       ['Выполня поручения любого начальника станции, победи 7 арахн',             '(20*ур)хр, (20*ур)пуль'],
    'Паучья проблема':              ['Выполня поручения любого начальника станции, победи 7 арахн',             '(10*ур)хр, 1ж'],
    'Санитары тоннелей':            ['Выполня поручения любого начальника станции, победи 8 арахн',             '(20*ур)хр, 1ж'],
    'Смертельный узор':             ['Выполня поручения любого начальника станции, победи 10 арахн',            '(20*ур)хр, 3ж'],

    'Горный зверь':                 ['Вызови питомца в бой 5 раз',                                              '(20*ур)хр, (15*ур)пуль'],
    'Чей питомец?':                 ['Вызови питомца в бой 7 раз',                                              '(7*ур)хр, (10*ур)пуль'],
    'Как Тузик грелку':             ['Вызови питомца в бой 15 раз',                                             '(7*ур)хр, (10*ур)пуль'],

    'Грустные глаза':               ['Покорми питомца 5 раз',                                                   '(5*ур)хр, 1ж'],
    'Голодный питомец':             ['Покорми питомца 7 раз',                                                   '(7*ур)хр, (10*ур)пуль'],
    'Надёжный питомец':             ['Накорми питомца 20 раз',                                                  '(15*ур)хр, (20*ур)пуль'],
    'Звериная преданность':         ['Накорми питомца 25 раз',                                                  '(20*ур)хр, 3корма'],

    'Спрятанные предметы':          ['Обыщи 5 палаток друзей',                                                  '(5*ур)хр, 1ж'],
    'Торговец дурью':               ['Обыщи 7 палаток друзей',                                                  '(5*ур)хр, (5*ур)пуль'],
    'Чужие палатки':                ['Обыщи 8 палаток друзей',                                                  '(5*ур)хр, (5*ур)пуль'],
    'Потерянный кулон':             ['Обыщи 10 палаток друзей',                                                 '(7*ур)хр, (7*ур)пуль'],
    'Под покровом тьмы':            ['Обыщи 10 палаток друзей',                                                 '(10*ур)хр, 3корма'],

    'Радость жизни':            ['Отработай 4 смены на упаковке чая',                                       '(5*ур)хр, 1ж'],
    'Чайный паек':              ['Отработай 3 смены на упаковке чая',                                       '(7*ур)хр, (10*ур)пуль'],
    'Отходняки':                ['Отработай 3 смены сборщиком грибов',                                      '(15*ур)хр, 3корма'],
    'Особенные грибы':          ['Отработай 3 смены сборщиком грибов',                                      '(7*ур)хр, (10*ур)пуль'],

    'Зоркий глаз':              ['Увеличь меткость на 3 единицы',                                           '(20*ур)хр, (20*ур)пуль'],
    'Свадебный салют':          ['Увеличь меткость на 4 единицы',                                           '(7*ур)хр, (12*ур)пуль'],
    'Мазила':                   ['Увеличь меткость на 5 единицы',                                           '(5*ур)хр, (14*ур)пуль'],
    'Думай как враг':           ['Увеличь меткость на 5 единицы',                                           '(5*ур)хр, (14*ур)пуль'],

    'Управление гневом':        ['Увеличь ярость на 5 единиц',                                              '(5*ур)хр, 1ж'],
    'Люди-звери':               ['Увеличь ярость на 7 единиц',                                              '(5*ур)хр, (20*ур)пуль'],

    'Правда жизни':             ['Увеличь выносливость на 5 единиц',                                        '(30*ур)хр, (25*ур)пуль'],
    'Срочная доставка':         ['Увеличь выносливость на 5 единиц',                                        '(5*ур)хр, (12*ур)пуль'],
    'Долгий путь':              ['Увеличь выносливость на 5 единиц',                                        '(5*ур)хр, 1ж'],
    'Слишком здоровый':         ['Увеличь выносливость на 6 единиц',                                        '(15*ур)хр, 1ж'],
    'Металлолом':               ['Увеличь выносливость на 6 единиц',                                        '(7*ур)хр, (17*ур)пуль'],

    'Проверка гранат':          ['Используй гранату РКГ-3 в бою 3 раза ',                                   '(15*ур)хр, 1ж'],


    'Стероиды':                 ['Отправляйся на <Третьяковскую>, открой окно букмекера и сделай ставку на'
                                 ' любую крысу',                                                            '(20*ур)хр, 1фишка'],
    'Одиночество в Рейхе':      ['Создай любую гранату у подрывника на "Пушкинской"',                       '(20*ур)хр, 1фишка'],

    'Долг сталкера':            ['Прими участие в клановом рейде на босса.',                                '(10*ур, 1VIP'],
}